"----------------------------------------
" 検索
"----------------------------------------
" 検索するときに大文字小文字を区別しない
set ignorecase
" 検索結果をハイライト表示
set hlsearch

"----------------------------------------
"表示
"----------------------------------------
"行数を表示
set number
"tab=space4
set tabstop=4
"インデントを増やす時も減らす時もスペース４つ分に
set shiftwidth=4
"autoindentを有効にする
set autoindent

if has('vim_starting')
    " 挿入モード時に非点滅の縦棒タイプのカーソル
    let &t_SI .= "\e[6 q"
    " ノーマルモード時に非点滅のブロックタイプのカーソル
    let &t_EI .= "\e[2 q"
    " 置換モード時に非点滅の下線タイプのカーソル
    let &t_SR .= "\e[4 q"
endif
